# Author = Kramar Mikhail Romanovich
# Group = P3113
# Date = 13.10.2025

# номер в ИСУ - 502511 % 5 = 1
# Вариант 1
'''С помощью регулярного выражения найти в тексте слова, в которых встречается
строго одна гласная буква (встречаться она может несколько раз). Пример таких
слов: окно, трава, молоко, etc.
После чего данные слова требуется отсортировать сначала по увеличению длины
слова, а затем лексикографически.'''

import re

tests = ['Классное слово – обороноспособность, которое должно идти после слов: трава и молоко',
         'Я так люблю чивикавики, они такие классные очень круто, что они есть, есть есть есть УРА',
         'ОКОННО РАМКА перекат обкат шалаш шалаш регулярное молоко чипикао и ии и и иии так',
         'рамочное изделие оформляется строго по шаблону',
         'никаких таких словечек в этом предложении',
         'очень круто делать такие задания поздно ночью - в два часа ночи самое-то']

arr1 = 'аАеЕёЁиИоОуУыЫэЭюЮяЯ'

for test in tests:
    answer = []
    for i in range(0, len(arr1) - 2, 2):
        elem = arr1[i:i + 2]
        pattern = rf'\b([бБвВгГдДжЖзЗйЙкКлЛмМнНпПрРсСтТфФхХцЦчЧшЩщЩьЬъЪ]*[{elem}]+[бБвВгГдДжЖзЗйЙкКлЛмМнНпПрРсСтТфФхХцЦчЧшЩщЩьЬъЪ]*)+\b'
        matches = re.finditer(pattern, test)
        for match in matches:
            answer.append(match.group())

    answer = list(set(answer))
    answer.sort(key=lambda x: (len(x), x.lower()))
    for elem in answer:
        print(elem)
    print('\n', end = '')
