ORG 0x282
RESULT: WORD ? ; Ячейка, содержащая 0x1 в случае успешного прохождения
всех тестов, иной результат в противном случае
CHECK1: WORD 0x0
CHECK2: WORD 0x0
CHECK3: WORD 0x0
CONST1: WORD 16542
CONST2: WORD -8191
CONST3: WORD 1335
ORG 0x289
START: CALL TEST1 ; Вызов первой тестовой подпрограммы
CALL TEST2 ; Вызов второй тестовой подпрограммы
CALL TEST3 ; Вызов третьей тестовой подпрограммы
LD #0x1 ; Загружаем в AC 0x1 для дальнейшей проверки
AND CHECK1 ; Побитовое «И» со всеми тестовыми результатами
AND CHECK2
AND CHECK3
ST $RESULT ; Сохраняем в ячейку с меткой RESULT
STOP: HLT ; Останов.
TEST1: LD $CONST1 ; Загружаем в AC первое тестовое значение
WORD 0xFF01 ; BGC ADDR - синтезированная команда (тут мы ожидаем
пропуск прыжка, так как 16542 > 8191)
JUMP ERROR1 ; Если не сработало, то прыгаем в ошибку
LD #0x1
ST CHECK1 ; Сохраняем в CHECK1 0x1
RET ; Возврат в основную программу
ERROR1: LD #0x0
CHECK1
ST $CHECK1 ; В случае неправильного срабатывания записываем 0x0 в
RET ; Возврат в основную программу
TEST2: LD $CONST2 ; Загружаем в AC второе тестовое значение
WORD 0xFF03 ; BGC ADDR - синтезированная команда (тут мы не ожидаем
переход, так как -8191 < 8191)
LD #0x1 ; Если не выполнен переход (так и надо), записываем 0x1
6
ST $CHECK2 ; Сохраняем в CHECK2 0x1, если условие корректно
отработано
RET ; Возврат в основную программу
ERROR2: LD #0x0 ; Сюда попадаем, если условие почему-то выполнено ->
ошибка
ST $CHECK2 ; Сохраняем в CHECK2 0x0
RET ; Возврат в основную программу
TEST3: LD $CONST3 ; Загружаем в AC третье тестовое значение
WORD 0xFF03 ; BGC ADDR - синтезированная команда (тут мы не ожидаем
переход, так как 1335 < 8191)
LD #0x1 ; Если не выполнен переход (так и надо), записываем 0x1
ST $CHECK3 ; Сохраняем в CHECK3 0x1, если условие корректно
отработано
RET ; Возврат в основную программу
ERROR3: LD #0x0 ; Сюда попадаем, если условие почему-то выполнено ->
ошибка
ST $CHECK3 ; Сохраняем в CHECK3 0x0
RET ; Возврат в основную программу
