ORG 0x46E ; Адрес начала нашей программы

START:	CLA ; Очищаем аккумулятор
S1:	IN 5 ; Ожидание ввода первого символа, заносим SR в AC
	AND #0x40 ; Проверяем 6-ой бит SR (битовой маской)
	BEQ S1 ; Если флаг Z==1 - spin-loop (переходим к метке S1)
	IN 4 ; Ввод первого символа

	CMP FINISH ; выставляем флаги по результату AC - FINISH
	BEQ EXIT; если Z==1, переходим к выходу

	SWAB ; Переносим первый символ в старшую часть AC
	ST (RES) ; Сохраняем в ячейку 0x5BD

S2:	IN 5 ; Ожидание ввода второго символа
	AND #0x40 ; 
	BEQ S2 ;

	CLA ; Очищаем аккумулятор 

	IN 4 ; Ввод второго символа
	
	CMP FINISH
	BEQ EXIT_PAIR ; Если получили стоп-символ, идём склеивать с первой буквой

	OR (RES) ; Добавляем первый введённый символ на место старшего байта
	ST (RES)+ ; Сохраняем слово из двух букв в ячейку RES, переходим к следующей за ней ячейкой
	CLA ; Очищаем аккумулятор на будущее
	JUMP S1 ; Переходим ко вводу следующего (нечётного) символа

EXIT_PAIR:	OR (RES) ; Доклеиваем стоп-символ, если попали сюда
EXIT:	ST (RES) ; Загружаем всё в RES
	HLT

RES:	WORD 0x5BD ; Адрес хранения результата
FINISH: WORD 0x0D ; Константа - стоп символ

