ORG 0x0

; в бэвм походу поломана работа с метками в случае прямой загрузки и при использовании WORD, хотя в методичке указан метод WORD МЕТКА, как рабочий))))


RABBIT:	WORD 0x18, 0x3B, 0x3F, 0x7F, 0xFF, 0xDF, 0xDF, 0x8F, 0x06, 0x00, 0x00
HIT_BOX:	WORD 0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80

HIT_ADR1:	WORD $HIT_BOX ; Адрес первого элемента массива HIT_BOX

ADR1:	WORD $RABBIT ; Адрес первого столбца зайца (адрес первого элемента массива)
PTR:	WORD $RABBIT ; Aдрес текущего столбца зайца
CNT:	WORD 0xB ; Количество столбцов, необходимых для одного зайца (длина массива)
EXPECTED_FLAG:	WORD 0x20
CURRENT_FLAG:	WORD 0x00
X_INDEX:	WORD 0x00 ; Индекс столбца, в который стреляем
Y_INDEX:	WORD 0x00 ; Индекс строки, в который стреляем

X_COORD:	WORD 0x00 ; Ячейка с координатой X
Y_COORD:	WORD 0x00 ; Ячейка с координатой Y
DELIMITER:	WORD 0x78 ; Код символа x в KOI8-R
TEMP:	WORD 0x00 ; Ячейка для хранения разряда единиц координаты X
X2:	WORD 0x00 ; Ячейка, которая хранит 2*X_COORD

KILLS:	WORD 0x00 ; Счётчик попаданий, изначально сброшен в 0

RELOAD:	LD $ADR1
	ST $PTR
	LD #0xB
	ST $CNT

; ---------------------------------- Процесс рисования зайца ----------------------------------

DRAW:	CLA
	IN 0x11 ; Заносим SR -> AC
	AND #0x40 ; Проверяем 6-ой бит SR
	BEQ DRAW ; Если Z==1, то дальше ждём готовности
		
	LD (PTR)+ ; Косвенная автоинкрементная загрузка значения по адресу, который лежит в PTR
	OUT 0x10 ; Выводим значение AC в бегущую строку
	
	LD $CURRENT_FLAG ; Загружаем текущее значение счётчика
	INC
	ST $CURRENT_FLAG

	CMP $EXPECTED_FLAG
	BEQ PREPARING ; Если значение EXPECTED_FLAG и CURRENT_FLAG совпали, переходим к стрельбе

CONTINUE:	LOOP $CNT ; Если CNT <= 0, то перескакиваем через одну команду

	JUMP $DRAW ; Если CNT > 0, переходим к рисованию следующего столбца зайца 

	JUMP $RELOAD ; Если заяц нарисован, переходим к "перезарядке" значений для нового зайца

; --------------------------------------- Код ввода и парсинга координаты выстрела ---------------------------------------

PREPARING:	SUB #0xB ; Вычитаем из AC (текущий счётчик) число 11
	ST $CURRENT_FLAG ; Сохраняем в ячейку с счётчиком

IN_X:	CLA ; Затираем аккумулятор
	IN 0x19 ; Заносим SR ВУ-8 в AC
	AND #0x40 ; Проверяем 6-ой бит
	BEQ IN_X ; Если устройство не готово, ждём готовности дальше
	IN 0x18 ; Заносим DR -> AC, теперь в аккумуляторе кодировка введённого символа

	CMP $DELIMITER ; Выставляем признаки результата вычитания разделяющего символа x
	BEQ IN_Y ; Если был введён символ x, переходим к вводу координаты Y
	
	SUB #0x30 ; получаем введённую цифру, вычитая из её кода значение 0x30
	ST $TEMP ; Сохраняем цифру в ячейку TEMP
	
	LD $X_COORD ; Загружаем содержимое X_COORD в AC
	ASL ; Умножаем AC на 2
	ST $X2 ; Сохраняем удвоенную координату X
	ASL ; Умножаем AC на 2
	ASL ; Умножаем AC на 2
	ADD $X2 ; Прибавляем 2*X к AC (получаем 8*X + 2*X  = 10*X)
	ADD $TEMP ; Прибавляем разряд единиц для X
	ST $X_COORD ; Сохраняем результат в X_COORD

	JUMP IN_X ; Переходим ко вводу следующего символа (может быть символ x или цифра для разряда единиц у координаты)

IN_Y:	CLA ; Чистим AC
	IN 0x19 ; Заносим SR ВУ-8 в AC
	AND #0x40 ; Проверяем 6-ой бит
	BEQ IN_Y ; Если устройство не готово, ждём готовности дальше
	IN 0x18 ; Заносим DR -> AC, теперь в аккумуляторе кодировка введённого символа
	
	SUB #0x30 ; Получаем введённую цифру, вычитая из её кода значение 0x30
	SUB #0x01 ; Вычитаем заранее единицу, чтобы Y лежал в диапазоне от 0 до 7 (для попаданий нужно)
	ST $Y_COORD ; Сохраняем координату Y в ячейку Y_COORD

; --------------------------------------- Код обнаружения попаданий по зайцу ---------------------------------------

X_CHECK:	LD $X_COORD ; Загружаем в AC координату X
	CMP #10 ; Сравниваем со столбцом 10
	BLT GET_INDEX1 ; Если X < 10 переходим к получению индекса
	BEQ INDICATOR ; Если Z==1, переходим к выводу текущего числа попаданий без проверки Y

	CMP #11 ; Сравниваем со столбцом 11
	BEQ INDICATOR ; Если Z==1, переходим к выводу текущего числа попаданий без проверки Y

	CMP #22 ; Сравниваем со столбцом 22
	BLT GET_INDEX2 ; Если 11 < X < 22, переходим к получению индекса
	BEQ INDICATOR ; Если Z==1, переходим к выводу текущего числа попаданий без проверки Y

	CMP #32 ; Сравниваем со столбцом 32
	BLT GET_INDEX3 ; Если 22 < X < 32, переходим к получению индекса
	BEQ INDICATOR ; Если Z==1, переходим к выводу текущего числа попаданий без проверки Y

GET_INDEX1:	SUB #0x01 ; Вычитаем единичку для диапазона от 0 до 8
	ADD $ADR1 ; Прибавляем адрес начала массива столбцов зайца для получения конкретного столбца
	ST $X_INDEX ; Сохраняем в X_INDEX адрес, в котором расположен столбец, в который стреляем
	JUMP Y_CHECK ; Переходим к проверке Y

GET_INDEX2:	CMP #21 ; Сравниваем со столбцом 21
	BEQ INDICATOR ; Если Z==1, переходим к выводу текущего числа попаданий без проверки Y
	SUB #0x0C ; Вычитаем 12 из AC (сюда включено вычитание единички для индекса)
	ADD $ADR1 ; Прибавляем адрес начала массива столбцов зайца для получения конкретного столбца 
	ST $X_INDEX 
	JUMP Y_CHECK ; Переходим к проверке Y	

GET_INDEX3:	SUB #0x17 ; Вычитаем 23 из AC (сюда опять включено вычитание единицы для индекса)
	ADD $ADR1 ; Прибавляем адрес начала массива столбцов зайца для получения конкретного столбца
	ST $X_INDEX
	JUMP Y_CHECK ; Переходим к проверке Y
	
Y_CHECK:	LD  $HIT_ADR1 ; Загружаем в AC адрес, по которому хранится нижний квадратик бегущей строки
	ADD $Y_COORD ; Добавляем к этому адресу смещение в виде координаты Y
	ST $Y_INDEX ; Сохраняем адрес ячейки, в которой хранится нужный нам элемент массива HIT_BOX
	LD (Y_INDEX) ; Загружаем содержимое ячейки с адресом, который лежит в Y_INDEX
	
	AND (X_INDEX) ; Логическое побитовое & с прямой косвенной адресацией, сравниваем столбец зайца с координатой Y
	BEQ INDICATOR ; Если получили 0 (Z==1), сразу переходим к выводу прошлого числа попаданий
	
	LD $KILLS ; Загружаем в AC счётчик попаданий
	INC ; Инкрементируем аккумулятор
	ST $KILLS ; Загружаем количество попаданий в ячейку KILLS

; -------------------------------------- Вывод количества попаданий по зайцам --------------------------------------

INDICATOR:	IN 0x15 ; Заносим SR семисегментного индикатора в AC
	AND #0x40 ; Проверяем 6-ой бит
	BEQ INDICATOR ; Если Z==1, дальше ожидаем готовности
	
	LD $KILLS ; Загружаем количество попаданий в аккумулятор
	OUT 0x14 ; Выводим количество попаданий

	CLA ; Очищаем аккумулятор, для загрузки 0x00 в X_COORD
	ST $X_COORD ; Обнуляем X_COORD

	JUMP CONTINUE ; Переходим к продолжению рисования наших зайцев
