# Author = Kramar Mikhail Romanovich
# Group = P3113
# Date = 13.10.2025

# номер в ИСУ - 502511 % 7 = 2
# Вариант 2

''' Дан текст. Необходимо найти в нём каждый фрагмент, где сначала идёт слово «ВТ»,
затем не более 4 слов, и после этого идёт слово «ИТМО».
Для простоты будем считать словом любую последовательность букв, цифр и знаков
«_» (то есть символов \w).'''

import re

arr = ['А ты знал, что ВТ – лучшая кафедра в ИТМО?',
       'Зачем нужна личная жизнь, когда есть ВТ так называемое ИТМО ВТ которое ВТ ИТМО в ИТМО',
       'Я так люблю ВТ ИТМО просто любимая кафедра ВТ - равно ИТМО',
       'Вчера шел по Кремниевой долине ВТ и увидел ИТМО ВТ ИТМО ИТМО ВТ',
       'Лабораторная ВТ ИТМО В ИТМО ПРОХОДИТ ИТМО',
       'Очень равноценные задания для каждого варианта',
       'ВТ слово - ВТ слово ИТМО слово ИТМО']

for elem in arr:
    if ' - ' in elem or ' – ' in elem:
        elem = elem.replace(' - ', ' ').replace(' – ', ' ')

    result = []
    patt = '\s+\w+'
    for i in range(5):
        pattern = rf'\bВТ\b{i*patt}\s+\bИТМО\b'
        super_pattern = rf'(?=({pattern}))'
        matches = re.findall(super_pattern, elem)
        if matches:
            for match in matches:
                result.append(match)

    print(result)



